[
    {
        "text": {
            "title": "ИСКЕ ИМЛЯ"
        },
    },
	{
        "title": "Тарих",
        "contents": [
            {
                "text": {
                    "title": "Кереш сүз",
                    "texts": [
                        "Бер телдә булган сүзләрне дөрес язылу юлларын өйрәтә торган фәнне имля дип атыйлар. Татар теленең мирасы булып калган гарәп хәрефенә нигезләнгән татар әлифбасы иске имля дип атала.",
                        "Төрки-татар халкы, мәдәниятле һәм белемгә омтылучан халык буларак, борынгы заманнардан ук үзләренең дәүләтләренә һәм язу мәдәниятенә ия булганнар. Бу халык ислам динен кабул иткәнче рун, туран язмаларын гамәлдә йөрткән. Ислам динен кабул итү белән Идел буе болгарлары гарәп әлифбасын үзләштерә башлый һәм, ниһаять, ислам дине рәсмиләштерелгәч, гарәп әлифбасы татар милли әлифбасы булып кабул ителә."
                    ]
                }
            },
            {
                "text": {
                    "title": "Ислам динен кабул итү вакыты",
                    "texts": [
                        "Рәсми рәвештә ислам дине Идел-Болгар җирендә милади белән 922 елның 11 (21) маенда, һиҗри белән 310 елның 12 мөхәррәм көнендә кабул ителә. Ләкин галимнәр тарафыннан (Ш.Мәрҗани, Р.Фахретдин) исбатлана ки, ислам дине Болгар җирендә VII-VIII гасырларда ук тарала башлый.",
                        "Хисаметдин бин Шәрәфетдин Әл-Мөслиминең «Тәварихы Болгария» китабында риваять ителә: «Болгар җирлегенә Пәйгамбәребез Мөхәммәд салләллаһу галәйһи вә сәлләмнең сәхабәләре һиҗри хисап буенча 9 елны Рамазан аеның 9 көнендә килеп, дин-ислам белән халыкны таныштыралар», ягъни Идел буе Болгарстанында ислам дине милади белән 631 елда тарала башлый."
                    ]
                }
            },
            {
                "text": {
                    "title": "Гарәп язуының әһәмияте",
                    "texts": [
                        "Гарәп әлифбасы мөселман дөньясының гарәп телле булмаган халыклар арасында берләштерү чыганагы булып та хезмәт иткән, бигрәк тә төрки халыклар арасында бер әлифба буларак уртак әдәби әсәрләр иҗат итәргә мөмкинлек биргән. Шулай ук гарәп язуы мөселман халыкларының үзара мәдәни, әдәби яктан якынаюына сәбәп булган.",
                        "Шулардан Мәхмүт Кашгари, Хуҗа Әхмәд Ясәви, Сәиф Сараи һәм башка шәхесләрнең хезмәтләре уртак төрки-татар мирасы булып карала."
                    ]
                }
            },
            {
                "text": {
                    "title": "Иске татар әлифбасының формалашуы",
                    "texts": [
                        "Татар теленең күп гасырларга сузылган тирән язма тарихы бар һәм аның иң әһәмиятле дәвере мең елдан артык хезмәт иткән гарәп графикасына бәйле.",
                        "Татар милли әдәби теле гарәп графикасы нигезендә формалашкан. Бу әдәби телдә күп санлы матур әдәбият әсәрләре тудырылган, гыйльми хезмәтләр, рәсми дәүләт документлары һәм аларга чыганак буларак дини эчтәлекле китаплар язылган.",
                        "Мең ел дәвамында төрки-татар әлифбасы камилләшү үзгәрешләрен кичергән. Бу үзгәрешләрне дүрт чорга бүлеп карарга була. Әмма бу бүленешне шартлы рәвештә кабул итү тиешле, чөнки еллар татар халкының иҗтимагый-сәяси үзгәрешләренә бәйле куелган:"
                    ]
                }
            },
            {
                "list": {
                    "title": "Төрки-татар әлифбасы чорлары",
                    "texts": [
                        "Борынгы чор – 922-1445 еллар (28 хәреф)",
                        "Кадими чор – 1445-1883 еллар (34 хәреф)",
                        "Җәдиди чор – 1883-1923 еллар",
                        "Яңа имля чоры – 1923-1928 еллар"
                    ]
                }
            },
            {
                "title": "Борынгы чор – 922-1445 еллар (28 хәреф)",
                "contents": [
                    {
                        "text": {
                            "texts": [
                                "Бу әлифба гарәп хәрефләреннән генә торган. Борынгы чорга караган татар-гарәп әлифбасы ислам дине рәсми рәвештә Болгар дәүләте тарафыннан кабул ителгәннән соң гамәлгә кергән дип санала.",
                                "Мәхмүт Кашгариның «Диване лөгатет төрк», Ягъкуб бин Ногманның «Болгар тарихы» (XII гасыр), Кол Галинең «Кыйссаи Йосыф» (XIII гасыр), Котбның «Хөсрәү вә Ширин», Сәиф Сараиның «Гөлстан бит төрки» (XIV гасыр)  әсәрләре шул чорга карый."
                            ]
                        }
                    },
                ]
            },
            {
                "title": "Кадими чор – 1445-1883 еллар (34 хәреф)",
                "contents": [
                    {
                        "text": {
                            "texts": [
                                "Кадими чорда борынгы чордагы 28 хәрефкә 6 тартык өстәлә.",
                                "Бу өстәүләр ике өлештән тора. Иң беренче, гарәп алифбасындагы хәрефләр татар теленә хас булган бөтен тартык авазларын белдермәү сәбәпле, гарәп графикасына нигезләнгән фарсы әлифбасыннан 4 хәреф өстәлә:"
                            ]
                        }
                    },
                    {
                        "hTable": [
                            {
                                "head": "پ",
                                "rows": [ "П" ]
                            },
                            {
                                "head": "چ",
                                "rows": [ "Ч" ]
                            },
                            {
                                "head": "ژ",
                                "rows": [ "Ж" ]
                            },
                            {
                                "head": "گ",
                                "rows": [ "Г" ]
                            }
                        ]
                    },
                    {
                        "text": {
                            "texts": [
                                "Соңыннан XIX гасырның ахырларында тагы ике хәреф:- ﯓ ң һәм ۋ – в өстәлә."
                            ],
                            "footer": "Игътибар итик!  - ﯓ «ң» хәрефе татар сүзләренә хас булса, ﯟ -«в» хәрефе фәкать рус сүзләренә генә хас!"
                        }
                    },
                    {
                        "hTable": [
                            {
                                "head": "ﯓ",
                                "rows": [ "Ң" ]
                            },
                            {
                                "head": "ﯟ",
                                "rows": [ "В" ]
                            },
                            {
                                "head": "گ",
                                "rows": [ "Г" ]
                            },
                            {
                                "head": "ژ",
                                "rows": [ "Ж" ]
                            },
                            {
                                "head": "چ",
                                "rows": [ "Ч" ]
                            },
                            {
                                "head": "پ",
                                "rows": [ "П" ]
                            }
                        ]
                    },
                    {
                        "text": {
                            "texts": [
                                "Кадими чорда куллана торган алифбаны иске татар теле әлифбасы дип тә атыйлар. Иске татар әлифбасын уртак төрки әлифба дип тә санарга була, чөнки бу әлифба белән язылган китапларны бөтен төрки халыклар да үз теле кебек укый ала, фәкать ڭ хәрефе نك яки نگ булып языла.",
                                "Кадими чорга караган татар халкының бай әдәби мирасы билгеле. Шулардан Казан ханлыгы вакытында (XV-XVI гасырлар) Мөхәммәдьярның «Нуры содур», «Төхфәи мәрдан» әсәрләрен, Рус патшалыгы вакытындагы иҗат ителгән Мәүлә Колыйның хикмәтләрен (XVII гасыр),  Габдерәхим Утыз-Имәнинең (XVIII гасыр), Габделҗәббар Кандалыйның (XIX гасыр) әсәрләрен һ.б. әйтергә була."
                            ]
                        }
                    },
                ]
            },
            {
                "title": "Җәдиди чор – 1883-1923 еллар",
                "contents": [
                    {
                        "text": {
                            "texts": [
                                "Җәдиди чорда иске татар теле алифбасына сузык авазларны белдерә торган хәрефләр өстәлә. Сузыкларның саны 10 яисә 6 хәреф белән исәпләнә. Әлифба 41 яисә 38 хәрефтән тора.",
                                "Исмәгыйль Гаспралы, Гаяз Исхакый, Фатих Әмирхан, Габдулла Тукай, Әхмәдһади Максуди кебек галимнәрнең һәм әдипләрнең әсәрләре шушы чорда иҗат ителгәннәр.",
                                "Кадими чордагы иске татар әлифбасында татар теленә хас булган сузык авазлар тулысынча билгеләнми иде, шуңа күрә аларны өйрәтер  өчен ул әлифба язуда кыенлыклар тудырган.",
                                "XIX гасырның ахырыннан башлап ХХ гасырның беренче ике дистәсендә татар халкы арасында язма иҗади хезмәтләр шундый югары дәрәҗәгә җитә ки, хәттә татар теленең формалашуын тулыландырырга һәм сузык авазларны язуда күрсәтүне җиңеләйтү өчен әлифбаның яңартылуы таләп ителә башлый. Әлифбаның яңартылуы татар халкының милли, мәдәни, иҗтимагый үзгәрешенә туры килә, шул яңарыш чоры җәдитчелек дип атала. Әлифбаның да бу вакытын җәдиди чоры дип атыйбыз.",
                                "Әхмәдһади Максуди, Каюм Насыйри эшен дәвам итеп, башка авторлар кебек «ә», «о», «ө», «ү», «ы», «е» [э] авазларын аерым хәрефләр белән билгеләргә тәкъдим итә.",
                                "Сүз башында язылышы:"
                            ]
                        }
                    },
                    {
                        "hTable": [
                            {
                                "head": "ﺋﮫ",
                                "rows": [ "Ә" ]
                            },
                            {
                                "head": "ﺋو",
                                "rows": [ "Ү" ]
                            },
                            {
                                "head": "اﯛ",
                                "rows": [ "О" ]
                            },
                            {
                                "head": "ﺋﯘ",
                                "rows": [ "Ө" ]
                            },
                            {
                                "head": "ا",
                                "rows": [ "Ы" ]
                            },
                            {
                                "head": "ﺋ",
                                "rows": [ "Э" ]
                            }
                        ]
                    },
                    {
                        "text": {
                            "texts": [
                                "Җәдиди әлифбаны үзләштерер өчен «Мөгаллим әүвәл» һәм «Беренче китап» дәреслекләре ярдәм итә. ا ى و хәрефләре нигезендә калып сузыклар саны 10-га җитә."
                            ]
                        }
                    },
                    {
                        "hTable": [
                            { "head": "ﺋ" },
                            { "head": "ا" },
                            { "head": "ﻴ" },
                            { "head": "ﺍﯿ" },
                            { "head": "ئوُ" },
                            { "head": "اﯛ" },
                            { "head": "ئو" },
                            { "head": "او" },
                            { "head": "ئه" },
                            { "head": "آ" },
                        ]
                    },
                    {
                        "text": {
                            "texts": [
                                "Әлифбаның тулы хәреф саны 40-тан уза.",
                                "Хәреф саны күп булу кайбер тел галимнәрен канәгатьләндерми һәм сузыклар санын киметергә тәкъдим ителә. Алдан әйткән о-ө, ы-е сузыклары я калын, я нечкә сүзләрдә генә кулланылалар, ә калынлык-нечкәлек тартык хәрефләр белән дә билгеләнә. Шуңа да бу парлы сузыкларны сүз уртасында hәм ахырында бер төрле язарга да тәкъдимнәр була: «ﯗ  о-ө» hәм «ﻱُ  ы-е» рәвешле.",
                                "Галимҗан Ибраһимов үзенең «Татар сарыфы» (1918) дәреслегендә: «Татар әлифбасы 38 хәрефтән тора: 32 тартык, 6 сузык», – дип яза, чөнки калынлык һәм нечкәлекне белдергән сузыклар берләштерелә. Сузыкларның укылышы, аларның алдындагы хәмзә яисә калын тартыклар язылышы белән аерыла."
                            ]
                        }
                    },
                ]
            },
            {
                "title": "Яңа имля чоры – 1923-1928 еллар",
                "contents": [
                    {
                        "text": {
                            "texts": [
                                "Совет чорында әлифбада  28 хәреф кала. Әмма бу хәрефләр борынгы чордагы алифбага туры килми.",
                                "Аермасы шуннан гыйбарәт. Алдагы чорлардагы күрсәтеп киткән әлифбаларның һәммәсендә татар сүзләрендә очрамый торган, фәкать гарәп алынмаларында кулланыла торган кайбер тартыклар бар:"
                            ]
                        }
                    },
                    {
                        "hTable": [
                            { "head": "ع" },
                            { "head": "ظ" },
                            { "head": "ض" },
                            { "head": "ذ" },
                            { "head": "ح" },
                            { "head": "ث" },
                        ]
                    },
                    {
                        "text": {
                            "texts": [
                                "Алар татар телендә булган тартыкларны әйтелеш буенча кабатлый.",
                                "Шуның шикелле хәрефләрне киметү максатыннан кайбер үзгәрешләр кертеп совет чорында яңа әлифба төзелә һәм аңа «яңа имля» дип исем бирелә. Кабатлана торган хәрефләрне киметү нәтиҗәсендә хәрефләр саны 28-гә кала.",
                                "Әйтелеше белән охшаш тартыкларны берләштерү нәтиҗәсендә, тартыклар саны кими, алты сузык хәрефе белән барлыгы 28 хәрефле әлифба ясала.",
                                "Мәсәлән:"
                            ]
                        }
                    },
                    {
                        "vTable": [
                            { "head": "س", "rows": [ "ث", "ص", "س" ] },
                            { "head": "ز", "rows": [ "ز", "ذ", "ظ", "ض" ]  },
                            { "head": "ت", "rows": [ "ط", "ت" ]  },
                        ]
                    },
                    {
                        "text": {
                            "texts": [
                                "Ләкин татар әлифбасы үзенең киңлек-гүзәллеген югалта. Алынма сүзләр дә яңача, икенче төрле яңгырый башлый.",
                                "Күрсәтелгән дүрт чор әлифбаларыннан тартык һәм сузык авазларны иң киң чагылдырганы җәдиди чорга карый. Әхмәдhади Максудиның «Мөгаллим әүвәл» әлифбасы моңа мисал. Дәресне дә иң беренче шул «Әлифба» нигезеннән башлап алып барырга була.",
                                "1930 елның беренче гыйнварында латин графикасы рәсми рәвештә гамәлгә кертелә. 1940 елда кириллица кулланыла башлый."
                            ]
                        }
                    },
                ]
            }
        ]
    },
    {
        "title": "Кагыйдәләр",
        "contents": [
            {
                "title": "Хәреф һәм аваз",
                "contents": [
                    {
                        "text": {
                            "title": "Хәреф һәм аваз төшенчәсе",
                            "texts": [
                                "Сүз әйтелгәндә авыздан чыга торган һәрбер аерым тавышны «аваз» диләр.",
                                "Бер авазның кәгазьгә язылган сүрәте «хәреф» дип атала.",
                                "«Кил» дисәк аерым өч тавыш чыга, димәк, бу сүздә өч аваз бар. Язганда ل ي ك рәвешендә сурәтлибез, шул өч хәрефне тоташтырып,  «كيل» дип язабыз.",
                                "Хәреф белән аваз бер-береннән бөтенләй аерым нәрсәләр:"
                            ]
                        },
                        "list": {
                            "title": "Хәреф белән аваз арасында төп аермалар",
                            "texts": [
                                "Хәрефне күз белән күрәбез, авазны колак белән ишетәбез",
                                "Хәрефне кул белән кәгазьгә яисә башка нәрсә өстенә язабыз, авазны тел-авыз белән әйтәбез",
                            ]
                        }
                    },
                    {
                        "text": {
                            "texts": [
                                "Мең елдан артык хезмәт иткән гарәп графикалы татар әлифбада хәрефләрнең саны төрле чорда төрлечә булып, 28-дән алып 40-ка кадәр җитә"
                            ]
                        },
                        "list": {
                            "title": "Хәрефләрнең саны",
                            "texts": [
                                "Борынгы чорда – 28 хәреф кулланган",
                                "Кадими чорда – 34 хәреф була",
                                "Җәдиди чорда – 38 (40) хәрефкә җитә",
                                "Яңа имля чорында – 28 хәрефкә калдырыла"
                            ]
                        }
                    },
                    {
                        "text": {
                            "title": "Хәрефләрнең язу һәм куллану буенча аермалыклары",
                            "texts": [
                                "Һәр чорның хәреф саны төрле булсада аларның уртаклары бар. Аермалыкларны кадими чор (урта имля) алифбасында карыйк"
                            ]
                        }
                    },
                    {
                        "text": {
                            "title": "Язу буенча аермалары",
                        },
                        "list": {
                            "texts": [
                                "**«хуруфун муттәсыйлә»** 26-ты хәреф. Аларны һәр ике ягыннан кушып язу мөмкин",
                                "**«хуруфун мунфәсыйлә»** сигез хәреф. Алар үзеннән әүвәл килгән хәрефкә генә кушылып, үзеннән соң килгән хәрефкә кушылмый языла"
                            ]
                        }
                    },
                    {
                        "text": {
                            "title": "Куллану буенча аермалары",
                            "texts": [
                                "Иске имлә әлифбасында кайбер хәрефләр гарәп сүзләрендә генә, кайберләре татар сүзләрендә генә кулланалар. Шуңа да язган вакытта сүзнең ясалышына игътибар итәргә кирәк",
                            ]
                        },
                        "list": {
                            "texts": [
                                "бу хәрефләр гарәп сүзләрендә генә очрый, төрки тамырлы татар сүзләрендә кулланмый: ذ  ع  ظ  ض  ح  ث",
                                "бу хәрефләр фарсы, рус һәм татар (төрки) телләрендә килергә мөмкин, мондый хәрефле сүзләр гарәп телендә юктыр: ڭ (ﯖ)  ۋ  ژ  گ  چ  پ"
                            ]
                        }
                    },
                    {
                        "text": {
                            "title": "Гарәп сүзләрендә генә кулланыла торган хәрефләр",
                            "texts": [
                                "Татар сүзләрендә бервакытта да кулланылмый, фәкать гарәп алынмаларында гына очрый торган хәрефләр бар. Алар барлыгы  6 тартык:"
                            ]
                        },
                        "hTable": [
                            { "head": "ض" },
                            { "head": "ظ" },
                            { "head": "ع" },
                            { "head": "ح" },
                            { "head": "ذ" },
                            { "head": "ث" },
                        ]
                    }
                ]
            },
            {
                "title": "Иске имлягә кагылышлы гомуми кагыйдәләр",
                "contents": [
                    
                ]
            },
        ]
    }
]
